In [1]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame

In [2]:
DF_obj = pd.DataFrame(np.arange(36).reshape(6,6))
DF_obj

    0   1   2   3   4   5
0   0   1   2   3   4   5
1   6   7   8   9  10  11
2  12  13  14  15  16  17
3  18  19  20  21  22  23
4  24  25  26  27  28  29
5  30  31  32  33  34  35

In [3]:
series_obj = pd.Series(np.arange(6))

In [4]:
series_obj

0    0
1    1
2    2
3    3
4    4
5    5
dtype: int32

In [6]:
# Werte löschen
series_obj.drop([2,4])

0    0
1    1
3    3
5    5
dtype: int32

In [8]:
# Zeile in DataFrame löschen
DF_obj.drop([2,4])

    0   1   2   3   4   5
0   0   1   2   3   4   5
1   6   7   8   9  10  11
3  18  19  20  21  22  23
5  30  31  32  33  34  35

In [9]:
# Spalte in DataFrame löschen
DF_obj.drop([2,5], axis=1)

    0   1   3   4
0   0   1   3   4
1   6   7   9  10
2  12  13  15  16
3  18  19  21  22
4  24  25  27  28
5  30  31  33  34